app/views/chefs/index.html.erb

SELECT COUNT(*) FROM "recipes" WHERE "recipes"."chef_id" = ?  [["chef_id", 1]]
---
                <li class="chef-title"><%= link_to chef.chefname.capitalize, chef_path(chef) %></li>
     <li><small><%= pluralize(chef.recipes.count, "recipe") if chef.recipes %></small></li>