app/views/chefs/show.html.erb


<% if @chef.recipes.count !=0 %>
---
SELECT COUNT(*) FROM "recipes" WHERE "recipes"."chef_id" = ?  [["chef_id", 2]]