app/views/recipes/_recipe.html.erb

            <p><%= truncate(recipe.description, length: 150) %></p>
            <% if recipe.ingredients.any? %>
---
SELECT "ingredients".* FROM "ingredients" INNER JOIN "recipe_ingredients" ON "ingredients"."id" = "recipe_ingredients"."ingredient_id" WHERE "recipe_ingredients"."recipe_id" = ?  [["recipe_id", 4]]
SELECT 1 AS one FROM "ingredients" INNER JOIN "recipe_ingredients" ON "ingredients"."id" = "recipe_ingredients"."ingredient_id" WHERE "recipe_ingredients"."recipe_id" = ? LIMIT ?  [["recipe_id", 3], ["LIMIT", 1]]