app/views/ingredients/show.html.erb

SELECT COUNT(*) FROM "recipes" INNER JOIN "recipe_ingredients" ON "recipes"."id" = "recipe_ingredients"."recipe_id" WHERE "recipe_ingredients"."ingredient_id" = ?  [["ingredient_id", 1]]
---

<% if @ingredient.recipes.count !=0 %>