app/controllers/chefs_controller.rb

    def index
        @chefs = Chef.paginate(page: params[:page], per_page: 2)
---
SELECT "chefs".* FROM "chefs"
SELECT COUNT(*) FROM "chefs"

    def create
        @chef = Chef.new(chef_params)
        if @chef.save
---
INSERT INTO "chefs" ("chefname", "email", "created_at", "updated_at", "password_digest", "admin") VALUES (?, ?, ?, ?, ?, ?)

    def show
        @chef_recipes= @chef.recipes.paginate(page: params[:page], per_page: 2)
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."chef_id" = ? ORDER BY "recipes"."updated_at" DESC LIMIT ? OFFSET ?  [["chef_id", 1], ["LIMIT", 2], ["OFFSET", 0]]
SELECT COUNT(*) FROM "recipes" WHERE "recipes"."chef_id" = ?  [["chef_id", 2]]

    def update
        if @chef.update(chef_params)
---
UPDATE "chefs" SET "chefname" = ?, "updated_at" = ? WHERE "chefs"."id" = ?  [["chefname", "qwer"], ["updated_at", "2022-07-28 09:17:26.674277"], ["id", 1]]

    def set_chef
        @chef = Chef.find(params[:id])
---
SELECT "chefs".* FROM "chefs" WHERE "chefs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]