app/controllers/ingredients_controller.rb

    def create
        @ingredient = Ingredient.new(ingredient_params)
        if @ingredient.save
---
INSERT INTO "ingredients" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Rice"], ["created_at", "2022-07-29 10:27:42.444119"], ["updated_at", "2022-07-29 10:27:42.444119"]]

    def show
        @ingredient_recipes= @ingredient.recipes.paginate(page: params[:page], per_page: 2)
---
SELECT "recipes".* FROM "recipes" INNER JOIN "recipe_ingredients" ON "recipes"."id" = "recipe_ingredients"."recipe_id" WHERE "recipe_ingredients"."ingredient_id" = ? ORDER BY "recipes"."updated_at" DESC LIMIT ? OFFSET ?  [["ingredient_id", 2], ["LIMIT", 2], ["OFFSET", 0]]
SELECT COUNT(*) FROM "recipes" INNER JOIN "recipe_ingredients" ON "recipes"."id" = "recipe_ingredients"."recipe_id" WHERE "recipe_ingredients"."ingredient_id" = ?  [["ingredient_id", 1]]

    def index
        @ingredients = Ingredient.paginate(page: params[:page], per_page: 2)
---
SELECT "ingredients".* FROM "ingredients" LIMIT ? OFFSET ?  [["LIMIT", 2], ["OFFSET", 0]]
SELECT COUNT(*) FROM "ingredients"

    def set_ingredient
        @ingredient = Ingredient.find(params[:id])
---
SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]