app/controllers/recipes_controller.rb

    def destroy
        Recipe.find(params[:id]).destroy
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]