app/controllers/recipes_controller.rb

SELECT "recipes".* FROM "recipes"
SELECT COUNT(*) FROM "recipes"
---
    def index
        @recipes= Recipe.paginate(page: params[:page], per_page: 2)

SELECT "comments".* FROM "comments" WHERE "comments"."recipe_id" = ? ORDER BY "comments"."updated_at" DESC LIMIT ? OFFSET ?  [["recipe_id", 3], ["LIMIT", 2], ["OFFSET", 0]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."recipe_id" = ?  [["recipe_id", 3]]
---
    def show
        @comment = Comment.new
        @comments = @recipe.comments.paginate(page: params[:page], per_page: 2)

INSERT INTO "recipes" ("name", "description", "created_at", "updated_at", "chef_id") VALUES (?, ?, ?, ?, ?)  [["name", "palao"], ["description", "yummy"], ["created_at", "2022-07-29 10:29:13.491754"], ["updated_at", "2022-07-29 10:29:13.491754"], ["chef_id", 2]]
---
    def create
        @recipe= Recipe.new(recipe_params)
        @recipe.chef = current_chef
        if @recipe.save

UPDATE "recipes" SET "description" = ?, "updated_at" = ? WHERE "recipes"."id" = ?  [["description", "gohar make nice dishes"], ["updated_at", "2022-07-29 10:32:03.358439"], ["id", 4]]
---
    def update
        if @recipe.update(recipe_params)

DELETE FROM "recipes" WHERE "recipes"."id" = ?  [["id", 4]]
---
    def destroy
        @recipe.destroy

SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = ? ORDER BY "recipes"."updated_at" DESC LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def set_recipe
        @recipe= Recipe.find(params[:id])