app/controllers/sessions_controller.rb

SELECT "chefs".* FROM "chefs" WHERE "chefs"."email" = ? LIMIT ?  [["email", "goharali123459876@gmail.com"], ["LIMIT", 1]]
---
    def create
        chef = Chef.find_by(email: params[:session][:email].downcase)